hoanghuy16011601/STM32-ARM-CORTEX-M3-BARE-METAL-PROGRAMMING/Header/HUY_STM32F103.h
#include "stdint.h"

#ifndef RCC_H
#define RCC_H
// CLOCK
typedef struct{
	volatile uint32_t HSION:1;
	volatile uint32_t HSIRDY:1;
	volatile uint32_t Reserved:1;
	volatile uint32_t HSITRIM:5;
	volatile uint32_t HSCIAL:8;
	volatile uint32_t HSEON:1;
	volatile uint32_t HSERDY:1;
	volatile uint32_t HSEBYP:1;
	volatile uint32_t CSSON:1;
	volatile uint32_t Reserved2:4;
	volatile uint32_t PLLON:1;
	volatile uint32_t PLLRDY:1;
	volatile uint32_t Reserved3:6;
}CR_Struct;

typedef union{
	uint32_t reg;
	CR_Struct bit;
}CR_Union;

typedef struct{
	volatile uint32_t SW:2;
	volatile uint32_t SWS:2;
	volatile uint32_t HPRE:4;
	volatile uint32_t PPRE1:3;
	volatile uint32_t PPRE2:3;
	volatile uint32_t ADCPRE:2;
	volatile uint32_t PLLSRC:1;
	volatile uint32_t PLLXTPRE:1;
	volatile uint32_t PLLMUL:4;
	volatile uint32_t USBPRE:1;
	volatile uint32_t Reserved:1;
	volatile uint32_t MCO:3;
	volatile uint32_t Reserved3:5;
}CFGR_Struct;

typedef union{
	uint32_t reg;
	CFGR_Struct bit;
}CFGR_Union;


typedef struct{
	volatile uint32_t LSIRDYF:1;
	volatile uint32_t LSERDYF:1;
	volatile uint32_t HSIRDYF:1;
	volatile uint32_t HSERDYF:1;
	volatile uint32_t PLLRDYF:1;
	volatile uint32_t Reserved:2;
	volatile uint32_t CSSF:1;
	volatile uint32_t LSIRDYE:1;
	volatile uint32_t LSERDYE:1;
	volatile uint32_t HSIRDYE:1;
	volatile uint32_t HSERDYE:1;
	volatile uint32_t PLLRDYE:1;
	volatile uint32_t Reserved2:3;
	volatile uint32_t LSIRDYC:1;
	volatile uint32_t LSERDYC:1;
	volatile uint32_t HSIRDYC:1;
	volatile uint32_t HSERDYC:1;
	volatile uint32_t PLLRDYC:1;
	volatile uint32_t Reserved3:2;
	volatile uint32_t CSSC:1;
	volatile uint32_t Reserved4:8;
}CIR_Struct;

typedef union{
	uint32_t reg;
	CR_Struct bit;
}CIR_Union;

typedef struct{
	volatile uint32_t AFIOEN:1;
	volatile uint32_t Reserved:1;
	volatile uint32_t IOPAEN:1;
	volatile uint32_t IOPBEN:1;
	volatile uint32_t IOPCEN:1;
	volatile uint32_t IOPDEN:1;
	volatile uint32_t IOPEEN:1;
	volatile uint32_t Reserved2:2;
	volatile uint32_t ADC1EN:1;
	volatile uint32_t ADC2EN:1;
	volatile uint32_t TIM1EN:1;
	volatile uint32_t SPI1EN:1;
	volatile uint32_t Reserved3:1;
	volatile uint32_t USART1EN:1;
	volatile uint32_t Reserved4:17;
}APB2ENR_Struct;

typedef union{
	uint32_t reg;
	APB2ENR_Struct bit;
}APB2ENR_Union;

typedef struct{
	volatile uint32_t TIM2EN:1;
	volatile uint32_t TIM3EN:1;
	volatile uint32_t TIM4EN:1;
	volatile uint32_t TIM5EN:1;
	volatile uint32_t TIM6EN:1;
	volatile uint32_t TIM7EN:1;
	volatile uint32_t Reserved:5;
	volatile uint32_t WWDGEN:1;
	volatile uint32_t Reserved2:2;
	volatile uint32_t SPI2EN:1;
	volatile uint32_t SPI3EN:1;
	volatile uint32_t Reserved3:1;
	volatile uint32_t USART2EN:1;
	volatile uint32_t USART3EN:1;
	volatile uint32_t UART4EN:1;
	volatile uint32_t UART5EN:1;
	volatile uint32_t I2C1EN:1;
	volatile uint32_t I2C2EN:1;
	volatile uint32_t Reserved4:2;
	volatile uint32_t CAN1EN:1;
	volatile uint32_t CAN2EN:1;
	volatile uint32_t BKPEN:1;
	volatile uint32_t PWREN:1;
	volatile uint32_t DACEN:1;
	volatile uint32_t Reserved5:2;
}APB1ENR_Struct;

typedef union{
	uint32_t reg;
	APB1ENR_Struct bit;
}APB1ENR_Union;

typedef struct{
	volatile uint32_t LSEON:1;
	volatile uint32_t LSERDY:1;
	volatile uint32_t LSEBYP:1;
	volatile uint32_t Reserved:5;
	volatile uint32_t RTCSEL:2;
	volatile uint32_t Reserved2:5;
	volatile uint32_t RTCEN:1;
	volatile uint32_t BDRST:1;
	volatile uint32_t Reserved3:15;
}BDCR_Struct;

typedef union{
	uint32_t reg;
	BDCR_Struct bit;
}BDCR_Union;

typedef struct{
	volatile uint32_t LSION:1;
	volatile uint32_t LSIRDY:1;
	volatile uint32_t Reserved:24;
	volatile uint32_t RMVF:1;
	volatile uint32_t Reserved2:1;
	volatile uint32_t PINRSTF:1;
	volatile uint32_t PORRSTF:1;
	volatile uint32_t SFTRSTF:1;
	volatile uint32_t IWDGRSTF:1;
	volatile uint32_t WWDGRSTF:1;
	volatile uint32_t LPWRRSTF:1;
}CSR_Struct;

typedef union{
	uint32_t reg;
	BDCR_Struct bit;
}CSR_Union;


typedef struct{
	CR_Union CR;
	CFGR_Union CFGR;
	CIR_Union CIR;
	uint32_t APB2RSTR;
	uint32_t APB1RSTR;
	uint32_t AHBENR;
	APB2ENR_Union APB2ENR;
	APB1ENR_Union APB1ENR;
	BDCR_Union BDCR;
	CSR_Union CSR;
}HUY_RCC_Struct;

#define HUY_RCC ((HUY_RCC_Struct *)0x40021000)
#endif


#ifndef GPIO_H
#define GPIO_H

typedef struct{
	volatile uint32_t MODE0:2;
	volatile uint32_t CNF0:2;
	volatile uint32_t MODE1:2;
	volatile uint32_t CNF1:2;
	volatile uint32_t MODE2:2;
	volatile uint32_t CNF2:2;
	volatile uint32_t MODE3:2;
	volatile uint32_t CNF3:2;
	volatile uint32_t MODE4:2;
	volatile uint32_t CNF4:2;
	volatile uint32_t MODE5:2;
	volatile uint32_t CNF5:2;
	volatile uint32_t MODE6:2;
	volatile uint32_t CNF6:2;
	volatile uint32_t MODE7:2;
	volatile uint32_t CNF7:2;
}CRL_Struct;

typedef union {
	uint32_t reg;
	CRL_Struct bit;
}CRL_Union;


typedef struct{
	volatile uint32_t MODE8:2;
	volatile uint32_t CNF8:2;
	volatile uint32_t MODE9:2;
	volatile uint32_t CNF9:2;
	volatile uint32_t MODE10:2;
	volatile uint32_t CNF10:2;
	volatile uint32_t MODE11:2;
	volatile uint32_t CNF11:2;
	volatile uint32_t MODE12:2;
	volatile uint32_t CNF12:2;
	volatile uint32_t MODE13:2;
	volatile uint32_t CNF13:2;
	volatile uint32_t MODE14:2;
	volatile uint32_t CNF14:2;
	volatile uint32_t MODE15:2;
	volatile uint32_t CNF15:2;
}CRH_Struct;

typedef union {
	uint32_t reg;
	CRH_Struct bit;
}CRH_Union;

typedef union{
	uint16_t Data;
	uint32_t reg;
}IDR_Union;

typedef union{
	uint16_t Data;
	uint32_t reg;
}ODR_Union;

typedef struct{
	volatile uint32_t BS0:1;
	volatile uint32_t BS1:1;
	volatile uint32_t BS2:1;
	volatile uint32_t BS3:1;
	volatile uint32_t BS4:1;
	volatile uint32_t BS5:1;
	volatile uint32_t BS6:1;
	volatile uint32_t BS7:1;
	volatile uint32_t BS8:1;
	volatile uint32_t BS9:1;
	volatile uint32_t BS10:1;
	volatile uint32_t BS11:1;
	volatile uint32_t BS12:1;
	volatile uint32_t BS13:1;
	volatile uint32_t BS14:1;
	volatile uint32_t BS15:1;
	volatile uint32_t BR0:1;
	volatile uint32_t BR1:1;
	volatile uint32_t BR2:1;
	volatile uint32_t BR3:1;
	volatile uint32_t BR4:1;
	volatile uint32_t BR5:1;
	volatile uint32_t BR6:1;
	volatile uint32_t BR7:1;
	volatile uint32_t BR8:1;
	volatile uint32_t BR9:1;
	volatile uint32_t BR10:1;
	volatile uint32_t BR11:1;
	volatile uint32_t BR12:1;
	volatile uint32_t BR13:1;
	volatile uint32_t BR14:1;
	volatile uint32_t BR15:1;
}BSRR_Struct;

