hoanghuy16011601/STM32-ARM-CORTEX-M3-BARE-METAL-PROGRAMMING/Header/HUY_STM32F103.h
typedef union {
	uint32_t reg;
	BSRR_Struct bit;
}BSRR_Union;

typedef struct{
	volatile uint32_t BR0:1;
	volatile uint32_t BR1:1;
	volatile uint32_t BR2:1;
	volatile uint32_t BR3:1;
	volatile uint32_t BR4:1;
	volatile uint32_t BR5:1;
	volatile uint32_t BR6:1;
	volatile uint32_t BR7:1;
	volatile uint32_t BR8:1;
	volatile uint32_t BR9:1;
	volatile uint32_t BR10:1;
	volatile uint32_t BR11:1;
	volatile uint32_t BR12:1;
	volatile uint32_t BR13:1;
	volatile uint32_t BR14:1;
	volatile uint32_t BR15:1;
	volatile uint32_t Reserved:16;
}BRR_Struct;

typedef union {
	uint32_t reg;
	BRR_Struct bit;
}BRR_Union;


typedef struct{
	volatile uint32_t LCK0:1;
	volatile uint32_t LCK1:1;
	volatile uint32_t LCK2:1;
	volatile uint32_t LCK3:1;
	volatile uint32_t LCK4:1;
	volatile uint32_t LCK5:1;
	volatile uint32_t LCK6:1;
	volatile uint32_t LCK7:1;
	volatile uint32_t LCK8:1;
	volatile uint32_t LCK9:1;
	volatile uint32_t LCK10:1;
	volatile uint32_t LCK11:1;
	volatile uint32_t LCK12:1;
	volatile uint32_t LCK13:1;
	volatile uint32_t LCK14:1;
	volatile uint32_t LCK15:1;
	volatile uint32_t LCKK:1;
	volatile uint32_t Reserved:15;
}LCKR_Struct;

typedef union {
	uint32_t reg;
	LCKR_Struct bit;
}LCKR_Union;

typedef struct{
	CRL_Union CRL;
	CRH_Union CRH;
	IDR_Union IDR;
	ODR_Union ODR;
	BSRR_Union BSRR;
	BRR_Union BRR;
	LCKR_Union LCKR;
}HUY_GPIO_Struct;

#define HUY_GPIO_PORTA ((HUY_GPIO_Struct *)0x40010800)
#define HUY_GPIO_PORTB ((HUY_GPIO_Struct *)0x40010C00)
#define HUY_GPIO_PORTC ((HUY_GPIO_Struct *)0x40011000)

#endif


#ifndef STK_H
#define STK_H
// Systick
typedef struct{
	volatile uint32_t ENABLE:1;
	volatile uint32_t TICKINT:1;
	volatile uint32_t CLKSOURCE:1;
	volatile uint32_t Reserved:13;
	volatile uint32_t COUNTFLAG:1;
	volatile uint32_t Reserved2:15;
}STK_CTRL_Struct;

typedef union{
	uint32_t reg;
	STK_CTRL_Struct bit;
}STK_CTRL_Union;

//
typedef struct{
	volatile uint32_t RELOAD:24;
	volatile uint32_t Reserved:8;
}STK_LOAD_Struct;

typedef union{
	uint32_t reg;
	STK_LOAD_Struct bit;
}STK_LOAD_Union;

//
typedef struct{
	volatile uint32_t CURRENT:24;
	volatile uint32_t Reserved:8;
}STK_VAL_Struct;

typedef union{
	uint32_t reg;
	STK_VAL_Struct bit;
}STK_VAL_Union;

//
typedef struct{
	volatile uint32_t TENMS:24;
	volatile uint32_t Reserved:6;
	volatile uint32_t SKEW:1;
	volatile uint32_t NOREF:1;
}STK_CALIB_Struct;

typedef union{
	uint32_t reg;
	STK_CALIB_Struct bit;
}STK_CALIB_Union;

//
typedef struct{
	STK_CTRL_Union CTRL;
	STK_LOAD_Union LOAD;
	STK_VAL_Union VAL;
	STK_CALIB_Union CALIB;
}HUY_STK_Struct;


#define HUY_Systick ((HUY_STK_Struct *)0xE000E010)
#endif


#ifndef SPI_H_LIB
#define SPI_H_LIB
/////SPI

typedef struct{
	volatile uint32_t CPHA:1;
	volatile uint32_t CPOL:1;
	volatile uint32_t MSTR:1;
	volatile uint32_t BR:3;
	volatile uint32_t SPE:1;
	volatile uint32_t LSBFIRST:1;
	volatile uint32_t SSI:1;
	volatile uint32_t SSM:1;
	volatile uint32_t RXONLY:1;
	volatile uint32_t DFF:1;
	volatile uint32_t CRCNEXT:1;
	volatile uint32_t CRCEN:1;
	volatile uint32_t BIDIOE:1;
	volatile uint32_t BIDIMODE:1;
	volatile uint32_t Reserved:16;
}SPI_CR1_Struct;

typedef union{
	uint32_t reg;
	SPI_CR1_Struct bit;
}SPI_CR1_Union;


typedef struct{
	volatile uint32_t RXDMAEN:1;
	volatile uint32_t TXDMAEN:1;
	volatile uint32_t SSOE:1;
	volatile uint32_t Reserved:2;
	volatile uint32_t ERRIE:1;
	volatile uint32_t RXNEIE:1;
	volatile uint32_t TXEIE:1;
	volatile uint32_t Reserved2:24;
}SPI_CR2_Struct;

typedef union{
	uint32_t reg;
	SPI_CR2_Struct bit;
}SPI_CR2_Union;


typedef struct{
	volatile uint32_t RXNE:1;
	volatile uint32_t TXE:1;
	volatile uint32_t CHSIDE:1;
	volatile uint32_t UDR:1;
	volatile uint32_t CRCERR:1;
	volatile uint32_t MODF:1;
	volatile uint32_t OVR:1;
	volatile uint32_t BSY:1;
	volatile uint32_t Reserved:24;
}SPI_SR_Struct;

typedef union{
	uint32_t reg;
	SPI_SR_Struct bit;
}SPI_SR_Union;

typedef struct{
	volatile uint32_t CHLEN:1;
	volatile uint32_t DATLEN:2;
	volatile uint32_t CKPOL:1;
	volatile uint32_t I2SSTD:2;
	volatile uint32_t Reserved:1;
	volatile uint32_t PCMSYNC:1;
	volatile uint32_t I2SCFG:2;
	volatile uint32_t I2SE:1;
	volatile uint32_t I2SMOD:1;
	volatile uint32_t Reserved2:20;
}SPI_I2SCFGR_Struct;

typedef union{
	uint32_t reg;
	SPI_I2SCFGR_Struct bit;
}SPI_I2SCFGR_Union;


typedef struct{
	volatile uint32_t I2SDIV:8;
	volatile uint32_t ODD:1;
	volatile uint32_t MCKOE:1;
	volatile uint32_t Reserved2:22;
}SPI_I2SPR_Struct;

typedef union{
	uint32_t reg;
	SPI_I2SPR_Struct bit;
}SPI_I2SPR_Union;


typedef struct{
	SPI_CR1_Union CR1;
	SPI_CR2_Union CR2;
	SPI_SR_Union SR;
	uint32_t DR;
	uint32_t CRCPR;
	uint32_t RXCRCR;
	uint32_t TXCRCR;
	SPI_I2SCFGR_Union I2SCFGR;
	SPI_I2SPR_Union I2SPR;
}HUY_SPI_Struct;

#define HUY_SPI1 ((HUY_SPI_Struct *)0x40013000)
#define HUY_SPI2_I2S ((HUY_SPI_Struct *)0x40003800)
#define HUY_SPI3_I2S ((HUY_SPI_Struct *)0x40003C00)

#endif


#ifndef I2C_H_LIB
#define I2C_H_LIB

typedef struct{
	volatile uint16_t PE:1;
	volatile uint16_t SMBUS:1;
	volatile uint16_t Reserved:1;
	volatile uint16_t SMBTYPE:1;
	volatile uint16_t ENARP:1;
	volatile uint16_t ENPEC:1;
	volatile uint16_t ENGC:1;
	volatile uint16_t NOSTRETCH:1;
	volatile uint16_t START:1;
	volatile uint16_t STOP:1;
	volatile uint16_t ACK:1;
	volatile uint16_t POS:1;
	volatile uint16_t PEC:1;
	volatile uint16_t ALERT:1;
	volatile uint16_t Reserved2:1;
	volatile uint16_t SWRST:1;
}I2C_CR1_Struct;

typedef union{
	I2C_CR1_Struct bit;
	uint32_t reg;
}I2C_CR1_Union;

//
typedef struct{
	volatile uint16_t FREQ:6;
	volatile uint16_t Reserved:2;
	volatile uint16_t ITERREN:1;
	volatile uint16_t ITEVTEN:1;
	volatile uint16_t ITBUFEN:1;
	volatile uint16_t DMAEN:1;
	volatile uint16_t LAST:1;
	volatile uint16_t Reserved2:3;
}I2C_CR2_Struct;

typedef union{
	I2C_CR2_Struct bit;
	uint32_t reg;
}I2C_CR2_Union;

//
typedef struct{
	volatile uint16_t ADD0:1;
	volatile uint16_t ADD1:7;
	volatile uint16_t ADD2:2;
	volatile uint16_t Reserved2:5;
	volatile uint16_t ADDMODE:1;
}I2C_OAR1_Struct;

typedef union{
	I2C_OAR1_Struct bit;
	uint32_t reg;
}I2C_OAR1_Union;

//
typedef struct{
	volatile uint16_t ENDUAL:1;
	volatile uint16_t ADD:7;
	volatile uint16_t Reserved:8;
}I2C_OAR2_Struct;

typedef union{
	I2C_OAR2_Struct bit;
	uint32_t reg;
}I2C_OAR2_Union;

//
typedef struct{
	unsigned char DATA;
	unsigned char Reserved;
}I2C_DR_Struct;

typedef union{
	I2C_DR_Struct bit;
	uint32_t reg;
}I2C_DR_Union;

//
typedef struct{
	volatile uint16_t SB:1;
	volatile uint16_t ADDR:1;
	volatile uint16_t BTF:1;
	volatile uint16_t ADD10:1;
	volatile uint16_t STOPF:1;
	volatile uint16_t Reserved:1;
	volatile uint16_t RXNE:1;
	volatile uint16_t TXE:1;
	volatile uint16_t BERR:1;
	volatile uint16_t ARLO:1;
	volatile uint16_t AF:1;
	volatile uint16_t OVR:1;
	volatile uint16_t PECERR:1;
	volatile uint16_t Reserved2:1;
	volatile uint16_t TIMEOUT:1;
	volatile uint16_t SMBALERT:1;
}I2C_SR1_Struct;

typedef union{
	I2C_SR1_Struct bit;
	uint32_t reg;
}I2C_SR1_Union;

//
typedef struct{
	volatile uint16_t MSL:1;
	volatile uint16_t BUSY:1;
	volatile uint16_t TRA:1;
	volatile uint16_t Reserved:1;
	volatile uint16_t GENCALL:1;
	volatile uint16_t SMBDEFAULT:1;
	volatile uint16_t SMBHOST:1;
	volatile uint16_t DUALF:1;
	volatile uint16_t PEC:8;
}I2C_SR2_Struct;

typedef union{
	I2C_SR2_Struct bit;
	uint32_t reg;
}I2C_SR2_Union;

//
typedef struct{
	volatile uint16_t CCR:12;
	volatile uint16_t Reserved:2;
	volatile uint16_t DUTY:1;
	volatile uint16_t F_S:1;
}I2C_CCR_Struct;

typedef union{
	I2C_CCR_Struct bit;
	uint32_t reg;
}I2C_CCR_Union;

//
typedef struct{
	volatile uint16_t TRISE:6;
	volatile uint16_t Reserved:10;
}I2C_TRISE_Struct;

typedef union{
	I2C_TRISE_Struct bit;
	uint32_t reg;
}I2C_TRISE_Union;


