hoanghuy16011601/STM32-ARM-CORTEX-M3-BARE-METAL-PROGRAMMING/Header/HUY_STM32F103.h
typedef struct{
	I2C_CR1_Union CR1;
	I2C_CR2_Union CR2;
	I2C_OAR1_Union OAR1;
	I2C_OAR2_Union OAR2;
	I2C_DR_Union DR;
	I2C_SR1_Union SR1;
	I2C_SR2_Union SR2;
	I2C_CCR_Union CCR;
	I2C_TRISE_Union TRISE;
}HUY_I2C_Struct;


#define HUY_I2C1 ((HUY_I2C_Struct *)0x40005400)
#define HUY_I2C2 ((HUY_I2C_Struct *)0x40005800)

#endif


#ifndef USART_H
#define USART_H
//// USART

typedef struct{
	volatile uint32_t PE:1;
	volatile uint32_t FE:1;
	volatile uint32_t NE:1;
	volatile uint32_t ORE:1;
	volatile uint32_t IDLE:1;
	volatile uint32_t RXNE:1;
	volatile uint32_t TC:1;
	volatile uint32_t TXE:1;
	volatile uint32_t LBD:1;
	volatile uint32_t CTS:1;
	volatile uint32_t Reserved:22;
}USART_SR_Struct;

typedef union{
	uint32_t reg;
	USART_SR_Struct bit;
}USART_SR_Union;

//

typedef struct{
	volatile uint32_t DR:9;
	volatile uint32_t Reserved:23;
}USART_DR_Struct;

typedef union{
	uint32_t reg;
	USART_DR_Struct bit;
}USART_DR_Union;


//
typedef struct{
	volatile uint32_t DIV_Fraction:4;
	volatile uint32_t DIV_Mantissa:12;
	volatile uint32_t Reserved:16;
}USART_BRR_Struct;

typedef union{
	uint32_t reg;
	USART_BRR_Struct bit;
}USART_BRR_Union;

//

typedef struct{
	volatile uint32_t SBK:1;
	volatile uint32_t RWU:1;
	volatile uint32_t RE:1;
	volatile uint32_t TE:1;
	volatile uint32_t IDLEIE:1;
	volatile uint32_t RXNEIE:1;
	volatile uint32_t TCIE:1;
	volatile uint32_t TXEIE:1;
	volatile uint32_t PEIE:1;
	volatile uint32_t PS:1;
	volatile uint32_t PCE:1;
	volatile uint32_t WAKE:1;
	volatile uint32_t M:1;
	volatile uint32_t UE:1;
	volatile uint32_t Reserved:18;
}USART_CR1_Struct;

typedef union{
	uint32_t reg;
	USART_CR1_Struct bit;
}USART_CR1_Union;


//
typedef struct{
	volatile uint32_t ADD:4;
	volatile uint32_t Reserved:1;
	volatile uint32_t LBDL:1;
	volatile uint32_t LBDIE:1;
	volatile uint32_t Reserved2:1;
	volatile uint32_t LBCL:1;
	volatile uint32_t CBHA:1;
	volatile uint32_t CPOL:1;
	volatile uint32_t CLKEN:1;
	volatile uint32_t STOP:2;
	volatile uint32_t RLINEN:1;
	volatile uint32_t Reserved3:17;
}USART_CR2_Struct;

typedef union{
	uint32_t reg;
	USART_CR2_Struct bit;
}USART_CR2_Union;


//
typedef struct{
	volatile uint32_t EIE:1;
	volatile uint32_t IREN:1;
	volatile uint32_t IRLP:1;
	volatile uint32_t HDSEL:1;
	volatile uint32_t NACK:1;
	volatile uint32_t SCEN:1;
	volatile uint32_t DMAR:1;
	volatile uint32_t DMAT:1;
	volatile uint32_t RTSE:1;
	volatile uint32_t CTSE:1;
	volatile uint32_t CTSEI:1;
	volatile uint32_t Reserved:21;
}USART_CR3_Struct;

typedef union{
	uint32_t reg;
	USART_CR3_Struct bit;
}USART_CR3_Union;

//
typedef struct{
	volatile uint32_t PSC:8;
	volatile uint32_t GT:8;
	volatile uint32_t Reserved:16;
}USART_GTPR_Struct;

typedef union{
	uint32_t reg;
	USART_GTPR_Struct bit;
}USART_GTPR_Union;

//
typedef struct{
	USART_SR_Union SR;
	USART_DR_Union DR;
	USART_BRR_Union BRR;
	USART_CR1_Union CR1;
	USART_CR2_Union CR2;
	USART_CR3_Union CR3;
	USART_GTPR_Union GTPR;
}HUY_USART_Struct;


#define HUY_USART1 ((HUY_USART_Struct *)0x40013800)
#define HUY_USART2 ((HUY_USART_Struct *)0x40004400)
#define HUY_USART3 ((HUY_USART_Struct *)0x40004800)
#define HUY_UART4  ((HUY_USART_Struct *)0x40004C00)
#define HUY_UART5  ((HUY_USART_Struct *)0x40005000)
////

#endif


#ifndef TIMER_H
#define TIMER_H

typedef struct{
	volatile uint32_t CEN:1;
	volatile uint32_t UDIS:1;
	volatile uint32_t URS:1;
	volatile uint32_t OPM:1;
	volatile uint32_t DIR:1;
	volatile uint32_t CMS:2;
	volatile uint32_t APRE:1;
	volatile uint32_t CKD:2;
	volatile uint32_t Reserved:22;
}TIMER1_8_CR1_Struct;

typedef union{
	uint32_t reg;
	TIMER1_8_CR1_Struct bit;
}TIMER1_8_CR1_Union;


typedef struct{
	volatile uint32_t CCPC:1;
	volatile uint32_t Reserved:1;
	volatile uint32_t CCUS:1;
	volatile uint32_t CCDS:1;
	volatile uint32_t MMS:3;
	volatile uint32_t TI1S:1;
	volatile uint32_t OIS1:1;
	volatile uint32_t OIS1N:1;
	volatile uint32_t OIS2:1;
	volatile uint32_t OIS2N:1;
	volatile uint32_t OIS3:1;
	volatile uint32_t OIS3N:1;
	volatile uint32_t OIS4:1;
	volatile uint32_t Reserved2:17;
}TIMER1_8_CR2_Struct;

typedef union{
	uint32_t reg;
	TIMER1_8_CR2_Struct bit;
}TIMER1_8_CR2_Union;


typedef struct{
	volatile uint32_t SMS:3;
	volatile uint32_t Reserved:1;
	volatile uint32_t TS:3;
	volatile uint32_t MSM:1;
	volatile uint32_t ETF:4;
	volatile uint32_t ETPS:2;
	volatile uint32_t ECE:1;
	volatile uint32_t ETP:1;
	volatile uint32_t Reserved2:16;
}TIMER1_8_SMCR_Struct;

typedef union{
	uint32_t reg;
	TIMER1_8_SMCR_Struct bit;
}TIMER1_8_SMCR_Union;


typedef struct{
	volatile uint32_t UIE:1;
	volatile uint32_t CC1IE:1;
	volatile uint32_t CC2IE:1;
	volatile uint32_t CC3IE:1;
	volatile uint32_t CC4IE:1;
	volatile uint32_t COMIE:1;
	volatile uint32_t TIE:1;
	volatile uint32_t BIE:1;
	volatile uint32_t UDE:1;
	volatile uint32_t CC1DE:1;
	volatile uint32_t CC2DE:1;
	volatile uint32_t CC3DE:1;
	volatile uint32_t CC4DE:1;
	volatile uint32_t COMDE:1;
	volatile uint32_t TDE:1;
	volatile uint32_t Reserved2:17;
}TIMER1_8_DIER_Struct;

typedef union{
	uint32_t reg;
	TIMER1_8_DIER_Struct bit;
}TIMER1_8_DIER_Union;

typedef struct{
	volatile uint32_t UIF:1;
	volatile uint32_t CC1IF:1;
	volatile uint32_t CC2IF:1;
	volatile uint32_t CC3IF:1;
	volatile uint32_t CC4IF:1;
	volatile uint32_t COMIF:1;
	volatile uint32_t TIF:1;
	volatile uint32_t BIF:1;
	volatile uint32_t Reserved:1;
	volatile uint32_t CC1OF:1;
	volatile uint32_t CC2OF:1;
	volatile uint32_t CC3OF:1;
	volatile uint32_t CC4OF:1;
	volatile uint32_t Reserved2:19;
}TIMER1_8_SR_Struct;

typedef union{
	uint32_t reg;
	TIMER1_8_SR_Struct bit;
}TIMER1_8_SR_Union;

typedef struct{
	volatile uint32_t UG:1;
	volatile uint32_t CC1G:1;
	volatile uint32_t CC2G:1;
	volatile uint32_t CC3G:1;
	volatile uint32_t CC4G:1;
	volatile uint32_t COMG:1;
	volatile uint32_t TG:1;
	volatile uint32_t BG:1;
	volatile uint32_t Reserved:24;
}TIMER1_8_EGR_Struct;

typedef union{
	uint32_t reg;
	TIMER1_8_EGR_Struct bit;
}TIMER1_8_EGR_Union;

typedef struct{
	volatile uint32_t CC1S:2;
	volatile uint32_t OC1FE:1;
	volatile uint32_t OC1PE:1;
	volatile uint32_t OC1M:3;
	volatile uint32_t OC1CE:1;
	volatile uint32_t CC2S:2;
	volatile uint32_t OC2FE:1;
	volatile uint32_t OC2PE:1;
	volatile uint32_t OC2M:3;
	volatile uint32_t OC2CE:1;
	volatile uint32_t Reserved:16;
}TIMER1_8_CCMR1_OutputMode_Struct;

