hoanghuy16011601/STM32-ARM-CORTEX-M3-BARE-METAL-PROGRAMMING/Header/HUY_STM32F103.h
typedef struct{
	volatile uint32_t CC1S:2;
	volatile uint32_t IC1PSC:2;
	volatile uint32_t IC1F:4;
	volatile uint32_t CC2S:2;
	volatile uint32_t IC2PSC:2;
	volatile uint32_t IC2F:4;
	volatile uint32_t Reserved:16;
}TIMER1_8_CCMR1_InputMode_Struct;

typedef union{
	uint32_t reg;
	TIMER1_8_CCMR1_OutputMode_Struct OutputCompare;
	TIMER1_8_CCMR1_InputMode_Struct InputCapture;
}TIMER1_8_CCMR1_Union;


typedef struct{
	volatile uint32_t CC3S:2;
	volatile uint32_t OC3FE:1;
	volatile uint32_t OC3PE:1;
	volatile uint32_t OC3M:3;
	volatile uint32_t OC3CE:1;
	volatile uint32_t CC4S:2;
	volatile uint32_t OC4FE:1;
	volatile uint32_t OC4PE:1;
	volatile uint32_t OC4M:3;
	volatile uint32_t OC4CE:1;
	volatile uint32_t Reserved:16;
}TIMER1_8_CCMR2_OutputMode_Struct;

typedef struct{
	volatile uint32_t CC3S:2;
	volatile uint32_t IC3PSC:2;
	volatile uint32_t IC3F:4;
	volatile uint32_t CC4S:2;
	volatile uint32_t IC4PSC:2;
	volatile uint32_t IC4F:4;
	volatile uint32_t Reserved:16;
}TIMER1_8_CCMR2_InputMode_Struct;

typedef union{
	uint32_t reg;
	TIMER1_8_CCMR2_OutputMode_Struct OutputCompare;
	TIMER1_8_CCMR2_InputMode_Struct InputCapture;
}TIMER1_8_CCMR2_Union;

typedef struct{
	volatile uint16_t CC1E:1;
	volatile uint16_t CC1P:1;
	volatile uint16_t CC1NE:1;
	volatile uint16_t CC1NP:1;
	volatile uint16_t CC2E:1;
	volatile uint16_t CC2P:1;
	volatile uint16_t CC2NE:1;
	volatile uint16_t CC2NP:1;
	volatile uint16_t CC3E:1;
	volatile uint16_t CC3P:1;
	volatile uint16_t CC3NE:1;
	volatile uint16_t CC3NP:1;
	volatile uint16_t CC4E:1;
	volatile uint16_t CC4P:1;
	volatile uint16_t Reserved:1;
	volatile uint16_t CC4NP:1;
}TIMER1_8_CCER_Struct;

typedef union{
	uint32_t reg;
	TIMER1_8_CCER_Struct bit;
}TIMER1_8_CCER_Union;


typedef union{
	volatile uint16_t Data;
	volatile uint32_t reg;
}TIMER1_8_CNT_Union;

typedef union{
	volatile uint16_t Data;
	volatile uint32_t reg;
}TIMER1_8_PSC_Union;

typedef union{
	volatile uint16_t Data;
	volatile uint32_t reg;
}TIMER1_8_ARR_Union;

typedef union{
	volatile uint8_t REP;
	volatile uint32_t reg;
}TIMER1_8_RCR_Union;

typedef union{
	volatile uint16_t Data;
	volatile uint32_t reg;
}TIMER1_8_CCR1_Union;

typedef union{
	volatile uint16_t Data;
	volatile uint32_t reg;
}TIMER1_8_CCR2_Union;

typedef union{
	volatile uint16_t Data;
	volatile uint32_t reg;
}TIMER1_8_CCR3_Union;

typedef union{
	volatile uint16_t Data;
	volatile uint32_t reg;
}TIMER1_8_CCR4_Union;

typedef struct{
	volatile uint32_t DTG:8;
	volatile uint32_t LOCK:2;
	volatile uint32_t OSSI:1;
	volatile uint32_t OSSR:1;
	volatile uint32_t BKE:1;
	volatile uint32_t BKP:1;
	volatile uint32_t AOE:1;
	volatile uint32_t MOE:1;
	volatile uint32_t Reserved:16;
}TIMER1_8_BDTR_Struct;

typedef union{
	uint32_t reg;
	TIMER1_8_BDTR_Struct bit;
}TIMER1_8_BDTR_Union;


typedef struct{
	volatile uint16_t DBA:5;
	volatile uint16_t Reserved:3;
	volatile uint16_t DBL:5;
	volatile uint16_t Reserved2:3;
}TIMER1_8_DCR_Struct;

typedef union{
	uint32_t reg;
	TIMER1_8_DCR_Struct bit;
}TIMER1_8_DCR_Union;

typedef struct{
	TIMER1_8_CR1_Union CR1;
	TIMER1_8_CR2_Union CR2;
	TIMER1_8_SMCR_Union SMCR;
	TIMER1_8_DIER_Union DIER;
	TIMER1_8_SR_Union SR;
	TIMER1_8_EGR_Union EGR;
	TIMER1_8_CCMR1_Union CCMR1;
	TIMER1_8_CCMR2_Union CCMR2;
	TIMER1_8_CCER_Union CCER;
	TIMER1_8_CNT_Union CNT;
	TIMER1_8_PSC_Union PSC;
	TIMER1_8_ARR_Union ARR;
	TIMER1_8_RCR_Union RCR;
	TIMER1_8_CCR1_Union CCR1;
	TIMER1_8_CCR2_Union CCR2;
	TIMER1_8_CCR3_Union CCR3;
	TIMER1_8_CCR4_Union CCR4;
	TIMER1_8_BDTR_Union BDTR;
	TIMER1_8_DCR_Union DCR;
	volatile uint32_t DMAR;
}HUY_TIMER1_8_Struct;

/////////

typedef struct{
	volatile uint32_t CEN:1;
	volatile uint32_t UDIS:1;
	volatile uint32_t URS:1;
	volatile uint32_t OPM:1;
	volatile uint32_t DIR:1;
	volatile uint32_t CMS:2;
	volatile uint32_t APRE:1;
	volatile uint32_t CKD:2;
	volatile uint32_t Reserved:22;
}TIMER2345_CR1_Struct;

typedef union{
	uint32_t reg;
	TIMER2345_CR1_Struct bit;
}TIMER2345_CR1_Union;


typedef struct{
	volatile uint32_t Reserved:3;
	volatile uint32_t CCDS:1;
	volatile uint32_t MMS:3;
	volatile uint32_t TI1S:1;
	volatile uint32_t Reserved2:24;
}TIMER2345_CR2_Struct;

typedef union{
	uint32_t reg;
	TIMER2345_CR2_Struct bit;
}TIMER2345_CR2_Union;


typedef struct{
	volatile uint32_t SMS:3;
	volatile uint32_t Reserved:1;
	volatile uint32_t TS:3;
	volatile uint32_t MSM:1;
	volatile uint32_t ETF:4;
	volatile uint32_t ETPS:2;
	volatile uint32_t ECE:1;
	volatile uint32_t ETP:1;
	volatile uint32_t Reserved2:16;
}TIMER2345_SMCR_Struct;

typedef union{
	uint32_t reg;
	TIMER2345_SMCR_Struct bit;
}TIMER2345_SMCR_Union;


typedef struct{
	volatile uint32_t UIE:1;
	volatile uint32_t CC1IE:1;
	volatile uint32_t CC2IE:1;
	volatile uint32_t CC3IE:1;
	volatile uint32_t CC4IE:1;
	volatile uint32_t Reserved:1;
	volatile uint32_t TIE:1;
	volatile uint32_t Reserved2:1;
	volatile uint32_t UDE:1;
	volatile uint32_t CC1DE:1;
	volatile uint32_t CC2DE:1;
	volatile uint32_t CC3DE:1;
	volatile uint32_t CC4DE:1;
	volatile uint32_t Reserved3:1;
	volatile uint32_t TDE:1;
	volatile uint32_t Reserved4:17;
}TIMER2345_DIER_Struct;

typedef union{
	uint32_t reg;
	TIMER2345_DIER_Struct bit;
}TIMER2345_DIER_Union;

typedef struct{
	volatile uint32_t UIF:1;
	volatile uint32_t CC1IF:1;
	volatile uint32_t CC2IF:1;
	volatile uint32_t CC3IF:1;
	volatile uint32_t CC4IF:1;
	volatile uint32_t Reserved:1;
	volatile uint32_t TIF:1;
	volatile uint32_t Reserved2:2;
	volatile uint32_t CC1OF:1;
	volatile uint32_t CC2OF:1;
	volatile uint32_t CC3OF:1;
	volatile uint32_t CC4OF:1;
	volatile uint32_t Reserved3:19;
}TIMER2345_SR_Struct;

typedef union{
	uint32_t reg;
	TIMER2345_SR_Struct bit;
}TIMER2345_SR_Union;

typedef struct{
	volatile uint32_t UG:1;
	volatile uint32_t CC1G:1;
	volatile uint32_t CC2G:1;
	volatile uint32_t CC3G:1;
	volatile uint32_t CC4G:1;
	volatile uint32_t Reserved:1;
	volatile uint32_t TG:1;
	volatile uint32_t Reserved2:1;
	volatile uint32_t Reserved3:24;
}TIMER2345_EGR_Struct;

typedef union{
	uint32_t reg;
	TIMER2345_EGR_Struct bit;
}TIMER2345_EGR_Union;

