hoanghuy16011601/STM32-ARM-CORTEX-M3-BARE-METAL-PROGRAMMING/Header/HUY_STM32F103.h
typedef struct{
	volatile uint32_t CC1S:2;
	volatile uint32_t OC1FE:1;
	volatile uint32_t OC1PE:1;
	volatile uint32_t OC1M:3;
	volatile uint32_t OC1CE:1;
	volatile uint32_t CC2S:2;
	volatile uint32_t OC2FE:1;
	volatile uint32_t OC2PE:1;
	volatile uint32_t OC2M:3;
	volatile uint32_t OC2CE:1;
	volatile uint32_t Reserved:16;
}TIMER2345_CCMR1_OutputMode_Struct;

typedef struct{
	volatile uint32_t CC1S:2;
	volatile uint32_t IC1PSC:2;
	volatile uint32_t IC1F:4;
	volatile uint32_t CC2S:2;
	volatile uint32_t IC2PSC:2;
	volatile uint32_t IC2F:4;
	volatile uint32_t Reserved:16;
}TIMER2345_CCMR1_InputMode_Struct;

typedef union{
	uint32_t reg;
	TIMER2345_CCMR1_OutputMode_Struct OutputCompare;
	TIMER2345_CCMR1_InputMode_Struct InputCapture;
}TIMER2345_CCMR1_Union;


typedef struct{
	volatile uint32_t CC3S:2;
	volatile uint32_t OC3FE:1;
	volatile uint32_t OC3PE:1;
	volatile uint32_t OC3M:3;
	volatile uint32_t OC3CE:1;
	volatile uint32_t CC4S:2;
	volatile uint32_t OC4FE:1;
	volatile uint32_t OC4PE:1;
	volatile uint32_t OC4M:3;
	volatile uint32_t OC4CE:1;
	volatile uint32_t Reserved:16;
}TIMER2345_CCMR2_OutputMode_Struct;

typedef struct{
	volatile uint32_t CC3S:2;
	volatile uint32_t IC3PSC:2;
	volatile uint32_t IC3F:4;
	volatile uint32_t CC4S:2;
	volatile uint32_t IC4PSC:2;
	volatile uint32_t IC4F:4;
	volatile uint32_t Reserved:16;
}TIMER2345_CCMR2_InputMode_Struct;

typedef union{
	uint32_t reg;
	TIMER2345_CCMR2_OutputMode_Struct OutputCompare;
	TIMER2345_CCMR2_InputMode_Struct InputCapture;
}TIMER2345_CCMR2_Union;

typedef struct{
	volatile uint16_t CC1E:1;
	volatile uint16_t CC1P:1;
	volatile uint16_t Reserved:2;
	volatile uint16_t CC2E:1;
	volatile uint16_t CC2P:1;
	volatile uint16_t Reserved2:2;
	volatile uint16_t CC3E:1;
	volatile uint16_t CC3P:1;
	volatile uint16_t Reserved3:2;
	volatile uint16_t CC4E:1;
	volatile uint16_t CC4P:1;
	volatile uint16_t Reserved4:2;
}TIMER2345_CCER_Struct;

typedef union{
	uint32_t reg;
	TIMER2345_CCER_Struct bit;
}TIMER2345_CCER_Union;


typedef union{
	volatile uint16_t Data;
	volatile uint32_t reg;
}TIMER2345_CNT_Union;

typedef union{
	volatile uint16_t Data;
	volatile uint32_t reg;
}TIMER2345_PSC_Union;

typedef union{
	volatile uint16_t Data;
	volatile uint32_t reg;
}TIMER2345_ARR_Union;


typedef union{
	volatile uint16_t Data;
	volatile uint32_t reg;
}TIMER2345_CCR1_Union;

typedef union{
	volatile uint16_t Data;
	volatile uint32_t reg;
}TIMER2345_CCR2_Union;

typedef union{
	volatile uint16_t Data;
	volatile uint32_t reg;
}TIMER2345_CCR3_Union;

typedef union{
	volatile uint16_t Data;
	volatile uint32_t reg;
}TIMER2345_CCR4_Union;



typedef struct{
	volatile uint16_t DBA:5;
	volatile uint16_t Reserved:3;
	volatile uint16_t DBL:5;
	volatile uint16_t Reserved2:3;
}TIMER2345_DCR_Struct;

typedef union{
	uint32_t reg;
	TIMER2345_DCR_Struct bit;
}TIMER2345_DCR_Union;

typedef struct{
	TIMER2345_CR1_Union CR1;
	TIMER2345_CR2_Union CR2;
	TIMER2345_SMCR_Union SMCR;
	TIMER2345_DIER_Union DIER;
	TIMER2345_SR_Union SR;
	TIMER2345_EGR_Union EGR;
	TIMER2345_CCMR1_Union CCMR1;
	TIMER2345_CCMR2_Union CCMR2;
	TIMER2345_CCER_Union CCER;
	TIMER2345_CNT_Union CNT;
	TIMER2345_PSC_Union PSC;
	TIMER2345_ARR_Union ARR;
	volatile uint32_t Reserved;
	TIMER2345_CCR1_Union CCR1;
	TIMER2345_CCR2_Union CCR2;
	TIMER2345_CCR3_Union CCR3;
	TIMER2345_CCR4_Union CCR4;
	TIMER1_8_DCR_Union DCR;
	volatile uint32_t DMAR;
}HUY_TIMER2345_Struct;

#define HUY_TIMER1 ((HUY_TIMER1_8_Struct *)0x40012C00)
#define HUY_TIMER8 ((HUY_TIMER1_8_Struct *)0x40013400)
#define HUY_TIMER2 ((HUY_TIMER2345_Struct *)0x40000000)
#define HUY_TIMER3 ((HUY_TIMER2345_Struct *)0x40000400)
#define HUY_TIMER4 ((HUY_TIMER2345_Struct *)0x40000800)
#define HUY_TIMER5 ((HUY_TIMER2345_Struct *)0x40000C00)



#endif
